Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/btzbsys.h
/*
 * Component description for BTZBSYS
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-06-23T14:51:53Z */
#ifndef _WBZ35_BTZBSYS_COMPONENT_H_
#define _WBZ35_BTZBSYS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR BTZBSYS                                      */
/* ************************************************************************** */

/* -------- BTZBSYS_SUBSYS_CNTRL_REG0 : (BTZBSYS Offset: 0x00) (R/W 32) SUBSYS_CNTRL_REG0 -------- */
#define BTZBSYS_SUBSYS_CNTRL_REG0_RESETVALUE  _UINT32_(0x00)                                       /*  (BTZBSYS_SUBSYS_CNTRL_REG0) SUBSYS_CNTRL_REG0  Reset Value */

#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_slp_ctrl_Pos _UINT32_(0)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_slp_ctrl Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_slp_ctrl_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_slp_ctrl_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_slp_ctrl Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_slp_ctrl(value) (BTZBSYS_SUBSYS_CNTRL_REG0_zb_slp_ctrl_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_slp_ctrl_Pos)) /* Assigment of value for zb_slp_ctrl in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_soft_reset_in_Pos _UINT32_(1)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_soft_reset_in Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_soft_reset_in_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_soft_reset_in_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_soft_reset_in Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_soft_reset_in(value) (BTZBSYS_SUBSYS_CNTRL_REG0_zb_soft_reset_in_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_soft_reset_in_Pos)) /* Assigment of value for zb_soft_reset_in in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_reset_by_fw_Pos _UINT32_(3)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_reset_by_fw Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_reset_by_fw_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_reset_by_fw_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_reset_by_fw Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_reset_by_fw(value) (BTZBSYS_SUBSYS_CNTRL_REG0_zb_reset_by_fw_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_reset_by_fw_Pos)) /* Assigment of value for zb_reset_by_fw in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_en_main_clk_Pos _UINT32_(4)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_en_main_clk Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_en_main_clk_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_en_main_clk_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) zb_en_main_clk Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_zb_en_main_clk(value) (BTZBSYS_SUBSYS_CNTRL_REG0_zb_en_main_clk_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_zb_en_main_clk_Pos)) /* Assigment of value for zb_en_main_clk in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_1_iom_en_Pos _UINT32_(5)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_1_iom_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_1_iom_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_1_iom_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_1_iom_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_1_iom_en(value) (BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_1_iom_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_1_iom_en_Pos)) /* Assigment of value for ant_div_sel_1_iom_en in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_2_iom_en_Pos _UINT32_(6)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_2_iom_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_2_iom_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_2_iom_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_2_iom_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_2_iom_en(value) (BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_2_iom_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_2_iom_en_Pos)) /* Assigment of value for ant_div_sel_2_iom_en in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_pdc_ov_Pos _UINT32_(16)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_pdc_ov Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_pdc_ov_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_pdc_ov_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_pdc_ov Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_pdc_ov(value) (BTZBSYS_SUBSYS_CNTRL_REG0_bt_pdc_ov_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_pdc_ov_Pos)) /* Assigment of value for bt_pdc_ov in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_sfr_wakeup_bit_Pos _UINT32_(17)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_sfr_wakeup_bit Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_sfr_wakeup_bit_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_sfr_wakeup_bit_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_sfr_wakeup_bit Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_sfr_wakeup_bit(value) (BTZBSYS_SUBSYS_CNTRL_REG0_bt_sfr_wakeup_bit_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_sfr_wakeup_bit_Pos)) /* Assigment of value for bt_sfr_wakeup_bit in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_hw_rc_re_cal_Pos _UINT32_(18)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_hw_rc_re_cal Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_hw_rc_re_cal_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_hw_rc_re_cal_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_hw_rc_re_cal Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_hw_rc_re_cal(value) (BTZBSYS_SUBSYS_CNTRL_REG0_bt_hw_rc_re_cal_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_hw_rc_re_cal_Pos)) /* Assigment of value for bt_hw_rc_re_cal in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_reset_by_fw_Pos _UINT32_(19)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_reset_by_fw Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_reset_by_fw_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_reset_by_fw_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_reset_by_fw Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_reset_by_fw(value) (BTZBSYS_SUBSYS_CNTRL_REG0_bt_reset_by_fw_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_reset_by_fw_Pos)) /* Assigment of value for bt_reset_by_fw in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_en_main_clk_Pos _UINT32_(20)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_en_main_clk Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_en_main_clk_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_en_main_clk_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) bt_en_main_clk Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_bt_en_main_clk(value) (BTZBSYS_SUBSYS_CNTRL_REG0_bt_en_main_clk_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_bt_en_main_clk_Pos)) /* Assigment of value for bt_en_main_clk in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_top_Pos _UINT32_(22)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) subsys_dbg_bus_sel_top Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_top_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_top_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) subsys_dbg_bus_sel_top Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_top(value) (BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_top_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_top_Pos)) /* Assigment of value for subsys_dbg_bus_sel_top in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_aclb_soft_rst_n_Pos _UINT32_(23)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) aclb_soft_rst_n Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_aclb_soft_rst_n_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_aclb_soft_rst_n_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) aclb_soft_rst_n Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_aclb_soft_rst_n(value) (BTZBSYS_SUBSYS_CNTRL_REG0_aclb_soft_rst_n_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_aclb_soft_rst_n_Pos)) /* Assigment of value for aclb_soft_rst_n in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_aclb_pwr_rst_n_Pos _UINT32_(24)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) aclb_pwr_rst_n Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_aclb_pwr_rst_n_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_aclb_pwr_rst_n_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) aclb_pwr_rst_n Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_aclb_pwr_rst_n(value) (BTZBSYS_SUBSYS_CNTRL_REG0_aclb_pwr_rst_n_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_aclb_pwr_rst_n_Pos)) /* Assigment of value for aclb_pwr_rst_n in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_Pos _UINT32_(25)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) subsys_dbg_bus_sel Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) subsys_dbg_bus_sel Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel(value) (BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_subsys_dbg_bus_sel_Pos)) /* Assigment of value for subsys_dbg_bus_sel in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_arb_Pos _UINT32_(26)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) disable_pclk_arb Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_arb_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_arb_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) disable_pclk_arb Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_arb(value) (BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_arb_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_arb_Pos)) /* Assigment of value for disable_pclk_arb in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_zb_mac_Pos _UINT32_(27)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) disable_pclk_zb_mac Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_zb_mac_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_zb_mac_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) disable_pclk_zb_mac Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_zb_mac(value) (BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_zb_mac_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_zb_mac_Pos)) /* Assigment of value for disable_pclk_zb_mac in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_bt_Pos _UINT32_(28)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) disable_pclk_bt Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_bt_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_bt_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) disable_pclk_bt Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_bt(value) (BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_bt_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_disable_pclk_bt_Pos)) /* Assigment of value for disable_pclk_bt in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_val_Pos _UINT32_(29)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_ovrd_val Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_val_Msk (_UINT32_(0x3) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_val_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_ovrd_val Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_val(value) (BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_val_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_val_Pos)) /* Assigment of value for ant_div_sel_ovrd_val in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_en_Pos _UINT32_(31)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_ovrd_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG0) ant_div_sel_ovrd_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_en(value) (BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG0_ant_div_sel_ovrd_en_Pos)) /* Assigment of value for ant_div_sel_ovrd_en in the BTZBSYS_SUBSYS_CNTRL_REG0 register */
#define BTZBSYS_SUBSYS_CNTRL_REG0_Msk         _UINT32_(0xFFDF007B)                                 /* (BTZBSYS_SUBSYS_CNTRL_REG0) Register Mask  */


/* -------- BTZBSYS_SUBSYS_CNTRL_REG1 : (BTZBSYS Offset: 0x04) (R/W 32) SUBSYS_CNTRL_REG1 -------- */
#define BTZBSYS_SUBSYS_CNTRL_REG1_RESETVALUE  _UINT32_(0x1800)                                     /*  (BTZBSYS_SUBSYS_CNTRL_REG1) SUBSYS_CNTRL_REG1  Reset Value */

